Tekla Open API Reference for Tekla Structures 2025
AnalysisArea.Profile Property
 Gets or sets the profile of the analysis area.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisCrossSection Profile { get; set; }
Public Property Profile As AnalysisCrossSection
	Get
	Set
Property Value
Type: AnalysisCrossSection
See Also
Reference
AnalysisArea Class
Tekla.Structures.Analysis Namespace